In [1]:
# Q1. List any five functions of the pandas library with excecution

In [2]:
data = {'Name': ['John', 'Jane', 'Jim', 'Joan'],
        'Age': [25, 30, 35, 40],
        'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer']
       }

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(data)

In [5]:
df

   Name  Age Occupation
0  John   25   Engineer
1  Jane   30     Doctor
2   Jim   35    Teacher
3  Joan   40     Lawyer

### Solution1-
<span style = 'font-size:0.8em;'>
five commonly used functions in the Pandas library along with their execution:
</span>

In [6]:
# 1. head(): This function is used to display the first few rows of the DataFrame.
df.head(3)

   Name  Age Occupation
0  John   25   Engineer
1  Jane   30     Doctor
2   Jim   35    Teacher

In [7]:
# 2. tail() : This function is used to display the last few rows of the DataFrame.
df.tail(3)

   Name  Age Occupation
1  Jane   30     Doctor
2   Jim   35    Teacher
3  Joan   40     Lawyer

In [8]:
# 3. info(): This function provides a concise summary of the DataFrame, including the data types of each column and the number of non-null values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        4 non-null      object
 1   Age         4 non-null      int64
 2   Occupation  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [9]:
# 4. describe(): This function generates descriptive statistics for numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, maximum, and quartile values.
df.describe()

             Age
count   4.000000
mean   32.500000
std     6.454972
min    25.000000
25%    28.750000
50%    32.500000
75%    36.250000
max    40.000000

In [10]:
# 5. sort_values(): This function is used to sort the DataFrame by the values of one or more columns.
df.sort_values(by = 'Age', ascending = False)

   Name  Age Occupation
3  Joan   40     Lawyer
2   Jim   35    Teacher
1  Jane   30     Doctor
0  John   25   Engineer

In [11]:
# Q2. Given a Pandas Dataframe df with a column 'A','B', and 'C'. write a python function to re-index the Dataframe with a new 
# index that starts from 1 and incremenets by 2 for each row

### Solution 2-

In [12]:
data = {
       "A" : [1,2,3,4],
       "B" : [10,20,30,40],
       "C" : [100,200,300,400]
}
df = pd.DataFrame(data)
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [13]:
def reindex_dataframe(df):
    # Resetting the columns index with new values generated using a lambda function
    df.index = df.reset_index(drop=True).index.map(lambda x: x * 2 + 1)
    return df

df = reindex_dataframe(df)
df

   A   B    C
1  1  10  100
3  2  20  200
5  3  30  300
7  4  40  400

In [14]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame
# and calculates the sum of the first three values in the 'Values' column.The function should print the sum to the console.

### Solution 3-

In [15]:
data = { "A" : [1,2,3,4,5],
         "B" : [10,20,30,40,50],
         "C" : [100,200,300,400,500],
         "Values": [10, 20, 30, 40, 50]
       }
df = pd.DataFrame(data)
df

   A   B    C  Values
0  1  10  100      10
1  2  20  200      20
2  3  30  300      30
3  4  40  400      40
4  5  50  500      50

In [16]:
# Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column:
def sum_first_three(df):
    total_sum = 0
    for value in df['Values'].head(3):
        total_sum = total_sum+value
    return total_sum

sum_first_three(df)

60

In [17]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains
# the number of words in each row of the 'Text' column.

### Solution 4-

In [18]:
data = {
    'Column1': [1, 2, 3],
    'Column2': ['A', 'B', 'C'],
    'Text': ['This is the first sentence.', 'Here is another sentence.', 'And one more sentence.']
}
df = pd.DataFrame(data)
df

   Column1 Column2                         Text
0        1       A  This is the first sentence.
1        2       B    Here is another sentence.
2        3       C       And one more sentence.

In [19]:
# function to count the number of words in each row of the 'Text' column

def Word_Count(df):
    count = []
    for t in df['Text']:
        count.append(len(t.split()))
    df['Word_Count'] = count
    return df
df  = Word_Count(df)
df

   Column1 Column2                         Text  Word_Count
0        1       A  This is the first sentence.           5
1        2       B    Here is another sentence.           4
2        3       C       And one more sentence.           4

In [20]:
def Word_Count(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))
    return df
df = Word_Count(df)
df

   Column1 Column2                         Text  Word_Count
0        1       A  This is the first sentence.           5
1        2       B    Here is another sentence.           4
2        3       C       And one more sentence.           4

In [21]:
# Q5. How is DataFrame.size() and DataFrame.shape() different?

### Solution 5

<span style = 'font-size:0.8em;'>

`DataFrame.size` and `DataFrame.shape` are both attributes of Pandas DataFrames but serve different purposes:

1. **DataFrame.size**:
   - `DataFrame.size` returns the total number of elements in the DataFrame, i.e., the number of cells.
   - It's calculated by multiplying the number of rows (`DataFrame.shape[0]`) by the number of columns (`DataFrame.shape[1]`).
   - It returns a single integer value representing the size of the DataFrame.



2. **DataFrame.shape**:
   - `DataFrame.shape` returns a tuple representing the dimensions of the DataFrame, i.e., the number of rows and columns.
   - It returns a tuple `(n_rows, n_columns)` where `n_rows` represents the number of rows and `n_columns` represents the number of columns.



In summary, `DataFrame.size` returns the total number of elements in the DataFrame, while `DataFrame.shape` returns a tuple representing the dimensions (number of rows and columns) of the DataFrame.
</span>

In [22]:
# Example for DataFrame.size

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
size = df.size
print(size)

6

In [23]:
# Example for DataFrame.shape
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})  
shape = df.shape
print(shape)

(3, 2)

In [24]:
# Q6. Which function of pandas do we use to read an excel file?

### Solution 6-

<span style = 'font-size:0.8em;'>

In Pandas, we can use the `read_excel()` function to read data from an Excel file into a DataFrame. 
By default, the `read_excel()` function reads the first sheet of the Excel file, but you can specify the sheet name or index using the sheet_name parameter if our Excel file has multiple sheets.
</span>

In [25]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 
# 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the
# username part from each email address.

# The username is the part of the email address that appears before the '@' symbol. For example, if the email address is
# john.doe@example.com, the 'Username' column should contain 'john.doe. Your function should extract the username from each
# email address and store it in the new 'Username' column.

### Solution 7-

In [26]:
data = {
    'Name': ['John', 'Emma', 'Michael', 'Sophia', 'William'],
    'Mobile': ['1234567890', '9876543210', '4567890123', '8901234567', '2345678901'],
    'Email': ['john.doe@example.com', 'emma.watson@example.com', 'michael.jordon@example.com', 'sophia.rais@example.com', 'sean.william@example.com']
}
df = pd.DataFrame(data)
df

      Name      Mobile                       Email
0     John  1234567890        john.doe@example.com
1     Emma  9876543210     emma.watson@example.com
2  Michael  4567890123  michael.jordon@example.com
3   Sophia  8901234567     sophia.rais@example.com
4  William  2345678901    sean.william@example.com

In [27]:
def extract_username(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

df = extract_username(df)
df

      Name      Mobile                       Email        Username
0     John  1234567890        john.doe@example.com        john.doe
1     Emma  9876543210     emma.watson@example.com     emma.watson
2  Michael  4567890123  michael.jordon@example.com  michael.jordon
3   Sophia  8901234567     sophia.rais@example.com     sophia.rais
4  William  2345678901    sean.william@example.com    sean.william

In [28]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.
# For example, if df contains the following values:
#   A B C
# 0 3 5 1
# 1 8 2 7
# 2 6 9 4
# 3 2 3 5
# 4 9 1 2
# Your function should select the following rows: A B C
# 1 8 2 7
# 4 9 1 2
# The function should return a new DataFrame that contains only the selected rows.

### Solution 8-

In [29]:
df = pd.DataFrame({'A': [3, 8, 6,2,9], 'B': [5, 2, 9,3,1], 'C': [1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [30]:
df[(df['A'] > 5) & (df['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [31]:
def rows_filter(df):
    df1 = df[(df['A'] > 5) & (df['B'] < 10)]
    return df1[['A','B','C']]

print(rows_filter(df))

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [32]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
# median, and standard deviation of the values in the 'Values' column.

### Solution 9-

In [33]:
data = { "A" : [1,2,3,4,5],
         "B" : [10,20,30,40,50],
         "C" : [100,200,300,400,500],
         "Values": [10, 20, 30, 40, 50]
       }
df = pd.DataFrame(data)
df

   A   B    C  Values
0  1  10  100      10
1  2  20  200      20
2  3  30  300      30
3  4  40  400      40
4  5  50  500      50

In [34]:
# function for calculating the mean, median, and standard deviation
def calculate_statistics(df):
    values_column = df['Values']
    mean_value = values_column.mean()
    median_value = values_column.median()
    std_deviation = values_column.std()
    return mean_value, median_value, std_deviation


# Calculating statistics
mean, median, std_dev = calculate_statistics(df)

# Printing the results
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std_dev)

Mean: 30.0
Median: 30.0
Standard Deviation: 15.811388300841896

In [35]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
# should include the current day.

### Solution 10-

In [36]:
data = {'Date': ['2024-05-01', '2024-05-02', '2024-05-03', '2024-05-04', '2024-05-05'],
        'Sales': [1000, 1500, 2000, 1800, 2500]}

# Creating DataFrame
df = pd.DataFrame(data)
df

         Date  Sales
0  2024-05-01   1000
1  2024-05-02   1500
2  2024-05-03   2000
3  2024-05-04   1800
4  2024-05-05   2500

In [37]:
def calculate_moving_average(df):
    # Convert 'Date' column to datetime type if not already
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Sort DataFrame by 'Date' column
    df = df.sort_values(by='Date')
    
    # Calculate moving average using a rolling window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df
print(calculate_moving_average(df))

        Date  Sales  MovingAverage
0 2024-05-01   1000         1000.0
1 2024-05-02   1500         1250.0
2 2024-05-03   2000         1500.0
3 2024-05-04   1800         1575.0
4 2024-05-05   2500         1760.0

In [38]:
# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.
# For example, if df contains the following values:
# Date
# 0 2023-01-01
# 1 2023-01-02
# 2 2023-01-03
# 3 2023-01-04
# 4 2023-01-05
# Your function should create the following DataFrame:

# Date Weekday
# 0 2023-01-01 Sunday
# 1 2023-01-02 Monday
# 2 2023-01-03 Tuesday
# 3 2023-01-04 Wednesday
# 4 2023-01-05 Thursday
# The function should return the modified DataFrame.

### Solution 11-

In [39]:
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [40]:
def add_weekday_column(df):
    # Convert 'Date' column to datetime type if not already
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Add a new column 'Weekday' containing weekday names
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df
print(add_weekday_column(df))

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [41]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

### Solution 12-

In [42]:
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04','2023-02-05','2023-02-15', '2023-01-05']}
df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-02-05
5  2023-02-15
6  2023-01-05

In [43]:
def select_date_range(df):
    df['Date'] = pd.to_datetime(df['Date'])
    
    # Select rows where the date is between '2023-01-01' and '2023-01-31'
    selected_rows = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    
    return selected_rows
print(select_date_range(df))

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
6 2023-01-05

In [44]:
# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
# be imported?

### Solution 13-

<span style = 'font-size:0.8em;'>

The first and foremost necessary library that needs to be imported to use the basic functions of pandas is `pandas` itself. You can import it with the following import statement:


```import pandas as pd```


This imports the pandas library and aliases it as `pd`, which is a common convention. This allows you to access the functions and classes provided by pandas using the `pd` prefix.
</span>